[
  {
    "id": "think-circular",
    "name": "Think Circular",
    "thumbnail": "/src/assets/think-circular-logo.svg",
    "tags": ["Branding", "UI/UX", "Illustration", "Wix"],
    "description": "End-to-end project for a circular fashion platform – from brand identity and custom illustrations to full website design and Wix implementation.",
    "link": "https://www.think-circular.co.uk/",
    "heroImage": "/src/assets/think-circular-hero.png",
    "role": "UI/UX Designer, Illustrator, Front-End Developer",
    "platform": "Wix",
    "overview": "Think Circular is a UK-based initiative dedicated to transforming the fashion industry through sustainable, circular solutions. Their services include stock exit strategies, de-labeling, re-commerce, recycling, repair, and returns management. The goal was to create a digital platform that effectively communicates these services and engages stakeholders in the circular economy.",
    "contributions": {
      "UI/UX Design": "Crafted a user-centric layout that guides visitors through the challenges of the fashion industry and Think Circular's solutions. Emphasized clarity and ease of navigation to enhance user engagement.",
      "Illustration & Graphics": "Designed custom illustrations and icons to visually represent key statistics and services, such as the number of garments produced annually and the impact on the environment. These visuals aid in storytelling and data comprehension.",
      "Front-End Development": "Implemented the design on the Wix platform, ensuring responsiveness across devices. Utilized Wix's tools to integrate interactive elements and maintain brand consistency throughout the site."
    },
    "highlights": [
      "Impactful Storytelling: The homepage presents compelling statistics, like '150 Billion Garments Produced' and '92 Million Tons of Greenhouse Emissions,' to immediately convey the urgency of the issue.",
      "Service Breakdown: Each service—Stock Exit, De-Labeling, Re-Commerce, Recycling, Repair, and Returns—is detailed with accompanying visuals, providing clear information on how Think Circular addresses each aspect of the circular economy.",
      "User Engagement: Integrated a contact form and WhatsApp link to facilitate easy communication, encouraging visitors to take action or seek more information."
    ],
    "takeaways": "This project exemplifies the fusion of design and development to create a platform that not only informs but also inspires action. By combining thoughtful UX design, custom illustrations, and responsive development, the website effectively communicates Think Circular's mission and services."
  },
  {
    "id": "cookie-jar-tech",
    "name": "Cookie Jar Tech",
    "thumbnail": "/src/assets/cjt-logo.svg",
    "tags": ["Branding", "UI/UX", "Illustration", "Webflow"],
    "description": "A fun, bold website built for Cookie Jar Tech — a platform connecting tech specialists with companies, minus the HR drama.",
    "link": "https://www.cookiejartech.lt/",
    "heroImage": "/src/assets/cjt-hero.png",
    "role": "UI/UX Designer, Illustrator, Front-End Developer",
    "platform": "Webflow",
    "overview": "Cookie Jar Tech is a Lithuania-based tech hiring platform that connects companies with vetted developers—without the hassle of traditional HR. The aim was to create a bold, energetic, and modern web presence that reflects their no-nonsense, developer-first attitude.",
    "contributions": {
      "UI/UX Design": "Designed a bold and approachable layout focused on clarity and fast navigation. The interface is friendly but professional, echoing the company's mission to make hiring stress-free.",
      "Illustration & Animation": "Created a full set of custom illustrations and iconography to represent services and concepts playfully. Integrated Lottie animations and micro-interactions to bring the brand personality to life.",
      "Front-End Development": "Developed the entire site using Webflow. Ensured responsive layouts, fluid interactions, and minimal JS where needed for performance. Used Webflow’s native animation features to deliver a lively user experience."
    },
    "highlights": [
      "Strong branding with a fun, modern tone that breaks away from traditional tech hiring platforms.",
      "Fully animated hero section and interactive illustrations to engage users.",
      "Highly responsive across all devices, with fluid transitions and subtle micro-interactions."
    ],
    "takeaways": "This project showcases the power of combining clear UX strategy, playful yet informative visuals, and performance-optimized development. It proved how branding, design, and motion can elevate a niche service platform into a memorable digital experience."
  },
  {
    "id": "olde-worlde",
    "name": "Olde Worlde",
    "thumbnail": "/src/assets/olde-worlde-logo.svg",
    "tags": ["Branding", "UI/UX", "Shopify"],
    "description": "A nostalgic, artisan-inspired Shopify store for Olde Worlde — offering vintage-style homeware, ironmongery, and lighting with timeless charm.",
    "link": "https://www.oldeworlde.eu/",
    "heroImage": "/src/assets/olde-worlde-hero.png",
    "role": "Brand Designer, UI/UX Designer, Front-End Developer",
    "platform": "Shopify",
    "overview": "Olde Worlde is an artisan-inspired ecommerce brand offering vintage-style ironmongery, lighting, and homeware across Europe. The goal was to design a store that felt timeless and authentic—reflecting the heritage and craftsmanship behind each product.",
    "contributions": {
      "Brand Identity": "Crafted a distinct brand identity that evokes the charm of vintage craftsmanship, including logo, color palette, and typography direction.",
      "UI/UX Design": "Designed a clean and elegant layout that balances old-world aesthetics with modern usability, focusing on clear product presentation and seamless browsing.",
      "Front-End Development": "Implemented the design using Shopify's templating system, customizing layouts and styling for responsiveness, and ensuring smooth performance and shopping flow."
    },
    "highlights": [
      "Vintage-inspired branding and visual storytelling throughout the store.",
      "Well-organized product categories that guide users effortlessly to their needs.",
      "Fully responsive and accessible experience across all modern devices."
    ],
    "takeaways": "Olde Worlde demonstrates how thoughtful design and tailored development can create an ecommerce experience that feels both charming and intuitive. From brand to cart, every detail was crafted to match the warmth and quality of the products themselves."
  },
  {
    "id": "ranchimall-messenger",
    "name": "RanchiMall Messenger",
    "thumbnail": "/src/assets/rm-messenger-logo.svg",
    "tags": ["UI/UX", "Web Components", "Blockchain", "JavaScript"],
    "description": "A secure, blockchain-based messaging platform offering chat, mail, and multisig transactions—all within a privacy-first, walletless web experience.",
    "link": "https://ranchimall.github.io/messenger/#/landing",
    "heroImage": "/src/assets/rm-messenger-hero.png",
    "role": "UI/UX Designer, Front-End Developer",
    "platform": "Custom Web App",
    "overview": "RanchiMall Messenger is a decentralized communication platform designed to combine chat, mail, and blockchain-based multisig transactions—all within a secure, privacy-focused interface. Built entirely with native Web Components and vanilla JavaScript, this project pushed the boundaries of what’s possible in the browser without any framework overhead. The goal was to create a walletless, user-friendly dApp experience that feels familiar yet offers the power of blockchain under the hood.",
    "contributions": {
      "UI/UX Design": "Designed an intuitive interface that seamlessly integrates chat, mail, and multisig transaction functionalities, ensuring a user-friendly experience across devices.",
      "Front-End Development": "Implemented the application using native Web Components and JavaScript, focusing on performance, responsiveness, and a modular architecture.",
      "Blockchain Integration": "Integrated FLO blockchain features to enable decentralized messaging and multisig transactions without requiring users to download a wallet."
    },
    "highlights": [
      "Seamless integration of chat, mail, and multisig transaction features in a single platform.",
      "Walletless architecture allowing users to interact with blockchain functionalities directly from the browser.",
      "Responsive design ensuring optimal user experience across various devices."
    ],
    "takeaways": "This project exemplifies the potential of combining blockchain technology with user-centric design to create secure and decentralized communication platforms. It highlights the importance of intuitive UI/UX in facilitating user adoption of complex technologies."
  },
  {
    "id": "circular-cars",
    "name": "Circular Cars",
    "thumbnail": "/src/assets/circular-cars-logo.svg",
    "tags": ["Branding", "UI/UX", "Wix"],
    "description": "A clean, trustworthy ecommerce platform for Circular Cars — a Spanish dealership specializing in quality used vehicles with a focus on transparency and customer service.",
    "link": "https://www.circularcars.es/",
    "heroImage": "/src/assets/circular-cars-hero.png",
    "role": "Brand Designer, UI/UX Designer, Front-End Developer",
    "platform": "Wix",
    "overview": "Circular Cars is a Spanish automotive platform focused on buying and selling pre-owned vehicles with trust, clarity, and sustainability at its core. The goal was to build a brand and website that feels fresh, reliable, and easy to use—reflecting their mission to make second-hand car buying a modern, confidence-driven experience. ",

    "contributions": {
      "Brand Identity": "Developed a modern, circular-themed logo and visual identity that communicates reliability and eco-consciousness, aligning with the brand's commitment to sustainable mobility.",
      "UI/UX Design": "Designed a user-friendly interface that highlights vehicle listings, detailed specifications, and purchasing options, ensuring an intuitive browsing experience for customers.",
      "Front-End Development": "Implemented the design on the Wix platform, customizing templates and integrating features to facilitate seamless navigation and responsive design across devices."
    },
    "highlights": [
      "Consistent branding that reinforces trust and professionalism throughout the website.",
      "Clear presentation of vehicle information, including specifications, pricing, and high-quality images.",
      "Responsive design ensuring optimal user experience on desktops, tablets, and mobile devices."
    ],
    "takeaways": "This project demonstrates the effective combination of cohesive branding, user-centric design, and practical implementation to create an ecommerce platform that meets the needs of both the business and its customers."
  },
  {
    "id": "standard-ui-components",
    "name": "Standard UI Components",
    "thumbnail": "/src/assets/web-components-logo.svg",
    "tags": ["Design System", "UI Library", "Web Components", "JavaScript"],
    "description": "A native Web Components library providing reusable, standards-based UI components designed for flexibility, accessibility, and performance.",
    "link": "https://ranchimall.github.io/standard-ui/components/",
    "heroImage": "/src/assets/web-components-library-hero.png",
    "role": "UI Design System Architect, Front-End Developer",
    "platform": "Custom Web Components",
    "overview": "Standard UI is a lightweight, framework-agnostic library of native Web Components designed to simplify modern front-end development. Built entirely with Custom Elements and Shadow DOM, the goal was to provide developers with reusable, accessible, and performant UI building blocks—without relying on frameworks or complex tooling.",

    "contributions": {
      "Design System": "Defined a cohesive set of UI components with consistent styling, behavior, and accessibility patterns to support scalable application development.",
      "Component Design": "Designed and prototyped individual components (buttons, inputs, modals, etc.) with clear API and customization options.",
      "Front-End Development": "Implemented each component using native Web Components standards (Custom Elements, Shadow DOM), vanilla JavaScript, and CSS, ensuring performance and interoperability."
    },
    "highlights": [
      "Standards-compliant components built with Custom Elements and Shadow DOM for encapsulation.",
      "Fully documented demo site showcasing every component with interactive examples.",
      "Lightweight, framework-agnostic, and optimized for accessibility and modular use."
    ],
    "takeaways": "This project exemplifies the power of native Web Components to build a robust, reusable design system without frameworks. It underscores the importance of standards-based development, modularity, and documentation in scalable UI architecture."
  }
]
